LightRail.WsdlTests/wcf.xsd

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="NothingService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsp:Policy wsu:Id="BasicHttpsBinding_INothingService_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="false"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/Interstate.SoapTestService"/><xs:element name="GetNothingValues"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="input" nillable="true" type="q1:ComplexInput" xmlns:q1="http://schemas.datacontract.org/2004/07/Interstate.SoapTestService"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetNothingValuesResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetNothingValuesResult" nillable="true" type="q2:ComplexOutput" xmlns:q2="http://schemas.datacontract.org/2004/07/Interstate.SoapTestService"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetNothingWithQuery"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="item" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetNothingWithQueryResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetNothingWithQueryResult" nillable="true" type="q3:SampleResponse" xmlns:q3="http://schemas.datacontract.org/2004/07/Interstate.SoapTestService"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Interstate.SoapTestService" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Interstate.SoapTestService"><xs:complexType name="ComplexInput"><xs:sequence><xs:element minOccurs="0" name="Id" type="xs:int"/><xs:element minOccurs="0" name="Query" nillable="true" type="tns:ComplexQuery"/></xs:sequence></xs:complexType><xs:element name="ComplexInput" nillable="true" type="tns:ComplexInput"/><xs:complexType name="ComplexQuery"><xs:sequence><xs:element minOccurs="0" name="From" type="xs:int"/><xs:element minOccurs="0" name="Size" type="xs:int"/></xs:sequence></xs:complexType><xs:element name="ComplexQuery" nillable="true" type="tns:ComplexQuery"/><xs:complexType name="ComplexOutput"><xs:sequence><xs:element minOccurs="0" name="Items" nillable="true" type="tns:ArrayOfItem"/></xs:sequence></xs:complexType><xs:element name="ComplexOutput" nillable="true" type="tns:ComplexOutput"/><xs:complexType name="ArrayOfItem"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="Item" nillable="true" type="tns:Item"/></xs:sequence></xs:complexType><xs:element name="ArrayOfItem" nillable="true" type="tns:ArrayOfItem"/><xs:complexType name="Item"><xs:sequence><xs:element minOccurs="0" name="Guid" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Id" type="xs:int"/></xs:sequence></xs:complexType><xs:element name="Item" nillable="true" type="tns:Item"/><xs:complexType name="SampleResponse"><xs:sequence><xs:element minOccurs="0" name="IntValue" type="xs:int"/><xs:element minOccurs="0" name="SampleInternal" nillable="true" type="tns:SampleInternal"/><xs:element minOccurs="0" name="StringValue" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="SampleResponse" nillable="true" type="tns:SampleResponse"/><xs:complexType name="SampleInternal"><xs:sequence><xs:element minOccurs="0" name="TheThink" type="xs:double"/></xs:sequence></xs:complexType><xs:element name="SampleInternal" nillable="true" type="tns:SampleInternal"/></xs:schema></wsdl:types><wsdl:message name="INothingService_GetNothingValues_InputMessage"><wsdl:part name="parameters" element="tns:GetNothingValues"/></wsdl:message><wsdl:message name="INothingService_GetNothingValues_OutputMessage"><wsdl:part name="parameters" element="tns:GetNothingValuesResponse"/></wsdl:message><wsdl:message name="INothingService_GetNothingWithQuery_InputMessage"><wsdl:part name="parameters" element="tns:GetNothingWithQuery"/></wsdl:message><wsdl:message name="INothingService_GetNothingWithQuery_OutputMessage"><wsdl:part name="parameters" element="tns:GetNothingWithQueryResponse"/></wsdl:message><wsdl:portType name="INothingService"><wsdl:operation name="GetNothingValues"><wsdl:input wsaw:Action="http://tempuri.org/INothingService/GetNothingValues" message="tns:INothingService_GetNothingValues_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/INothingService/GetNothingValuesResponse" message="tns:INothingService_GetNothingValues_OutputMessage"/></wsdl:operation><wsdl:operation name="GetNothingWithQuery"><wsdl:input wsaw:Action="http://tempuri.org/INothingService/GetNothingWithQuery" message="tns:INothingService_GetNothingWithQuery_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/INothingService/GetNothingWithQueryResponse" message="tns:INothingService_GetNothingWithQuery_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_INothingService" type="tns:INothingService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetNothingValues"><soap:operation soapAction="http://tempuri.org/INothingService/GetNothingValues" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetNothingWithQuery"><soap:operation soapAction="http://tempuri.org/INothingService/GetNothingWithQuery" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:binding name="BasicHttpsBinding_INothingService" type="tns:INothingService"><wsp:PolicyReference URI="#BasicHttpsBinding_INothingService_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetNothingValues"><soap:operation soapAction="http://tempuri.org/INothingService/GetNothingValues" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetNothingWithQuery"><soap:operation soapAction="http://tempuri.org/INothingService/GetNothingWithQuery" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="NothingService"><wsdl:port name="BasicHttpBinding_INothingService" binding="tns:BasicHttpBinding_INothingService"><soap:address location="http://lightrail-2.azurewebsites.net/nothing.svc"/></wsdl:port><wsdl:port name="BasicHttpsBinding_INothingService" binding="tns:BasicHttpsBinding_INothingService"><soap:address location="https://lightrail-2.azurewebsites.net/nothing.svc"/></wsdl:port></wsdl:service></wsdl:definitions>
